app/views/snippets/_form.html.erb

    <%= form.label :tags%>
    <%= form.collection_select :tag, Tag.all, :id, :slug %>
---
SELECT "tags".* FROM "tags"