app/controllers/snippets_lists_controller.rb

SELECT "snippets_lists".* FROM "snippets_lists"
---
  def index
    @snippets_lists = SnippetsList.all

SELECT "snippets_lists".* FROM "snippets_lists" WHERE "snippets_lists"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_snippets_list
      @snippets_list = SnippetsList.find(params[:id])