app/controllers/snippets_controller.rb

  def index
    @snippets = Snippet.all
---
SELECT "snippets".* FROM "snippets"