app/controllers/snippets_controller.rb

  def index
    @tags= Tag.where("snippet_id =?",params[:id].to_i)
---
SELECT "tags".* FROM "tags" WHERE "tags"."snippet_id" = $1 AND "tags"."id" IS NULL  [["snippet_id", nil]]

  def show
    @snippet=Snippet.find_by_id(params[:id])
    @tags= Tag.where("snippet_id = :query",query:params[:id])
---
SELECT "snippets".* FROM "snippets" WHERE "snippets"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."snippet_id" = $1 AND "tags"."id" = $2  [["snippet_id", nil], ["id", 5]]

  def create
    @snippet = Snippet.new(snippet_params)

    respond_to do |format|
      if @snippet.save
---
INSERT INTO "snippets" ("trigger", "replacement", "is_form", "is_public", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["trigger", "test"], ["replacement", "waeaewra"], ["is_form", false], ["is_public", false], ["created_at", "2020-12-23 19:01:43.260223"], ["updated_at", "2020-12-23 19:01:43.260223"]]

  def update
    respond_to do |format|
      if @snippet.update(snippet_params)
---
UPDATE "snippets" SET "trigger" = $1, "updated_at" = $2 WHERE "snippets"."id" = $3  [["trigger", "isitwork"], ["updated_at", "2020-12-23 03:22:25.275703"], ["id", 1]]

  def destroy
    @snippet.destroy
---
DELETE FROM "snippets" WHERE "snippets"."id" = $1  [["id", 1]]

    def set_snippet
      @snippet = Snippet.find(params[:id])
---
SELECT "snippets".* FROM "snippets" WHERE "snippets"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]