app/controllers/tags_controller.rb

INSERT INTO "tags" ("slug", "is_public", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["slug", "test"], ["is_public", false], ["created_at", "2020-12-16 22:30:16.401080"], ["updated_at", "2020-12-16 22:30:16.401080"]]
---
  def create
    @tag = Tag.new(tag_params)

    respond_to do |format|
      if @tag.save